arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom3208.h
/* EVSYS.CHANNEL1  bit masks and bit positions */
/* EVSYS_GENERATOR  is already defined. */

/* EVSYS.CHANNEL2  bit masks and bit positions */
/* EVSYS_GENERATOR  is already defined. */

/* EVSYS.CHANNEL3  bit masks and bit positions */
/* EVSYS_GENERATOR  is already defined. */

/* EVSYS.CHANNEL4  bit masks and bit positions */
/* EVSYS_GENERATOR  is already defined. */

/* EVSYS.CHANNEL5  bit masks and bit positions */
/* EVSYS_GENERATOR  is already defined. */

/* EVSYS.USERCCLLUT0A  bit masks and bit positions */
#define EVSYS_CHANNEL_gm  0xFF  /* Channel selector group mask. */
#define EVSYS_CHANNEL_gp  0  /* Channel selector group position. */
#define EVSYS_CHANNEL0_bm  (1<<0)  /* Channel selector bit 0 mask. */
#define EVSYS_CHANNEL0_bp  0  /* Channel selector bit 0 position. */
#define EVSYS_CHANNEL1_bm  (1<<1)  /* Channel selector bit 1 mask. */
#define EVSYS_CHANNEL1_bp  1  /* Channel selector bit 1 position. */
#define EVSYS_CHANNEL2_bm  (1<<2)  /* Channel selector bit 2 mask. */
#define EVSYS_CHANNEL2_bp  2  /* Channel selector bit 2 position. */
#define EVSYS_CHANNEL3_bm  (1<<3)  /* Channel selector bit 3 mask. */
#define EVSYS_CHANNEL3_bp  3  /* Channel selector bit 3 position. */
#define EVSYS_CHANNEL4_bm  (1<<4)  /* Channel selector bit 4 mask. */
#define EVSYS_CHANNEL4_bp  4  /* Channel selector bit 4 position. */
#define EVSYS_CHANNEL5_bm  (1<<5)  /* Channel selector bit 5 mask. */
#define EVSYS_CHANNEL5_bp  5  /* Channel selector bit 5 position. */
#define EVSYS_CHANNEL6_bm  (1<<6)  /* Channel selector bit 6 mask. */
#define EVSYS_CHANNEL6_bp  6  /* Channel selector bit 6 position. */
#define EVSYS_CHANNEL7_bm  (1<<7)  /* Channel selector bit 7 mask. */
#define EVSYS_CHANNEL7_bp  7  /* Channel selector bit 7 position. */

/* EVSYS.USERCCLLUT0B  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* EVSYS.USERCCLLUT1A  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* EVSYS.USERCCLLUT1B  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* EVSYS.USERCCLLUT2A  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* EVSYS.USERCCLLUT2B  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* EVSYS.USERCCLLUT3A  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* EVSYS.USERCCLLUT3B  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* EVSYS.USERADC0  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* EVSYS.USEREVOUTA  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* EVSYS.USEREVOUTB  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* EVSYS.USEREVOUTC  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* EVSYS.USEREVOUTD  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* EVSYS.USEREVOUTE  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* EVSYS.USEREVOUTF  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* EVSYS.USERUSART0  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* EVSYS.USERUSART1  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* EVSYS.USERUSART2  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* EVSYS.USERUSART3  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* EVSYS.USERTCA0  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* EVSYS.USERTCB0  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* EVSYS.USERTCB1  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* EVSYS.USERTCB2  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* EVSYS.USERTCB3  bit masks and bit positions */
/* EVSYS_CHANNEL  is already defined. */

/* FUSE - Fuses */
/* FUSE.WDTCFG  bit masks and bit positions */
#define FUSE_PERIOD_gm  0x0F  /* Watchdog Timeout Period group mask. */
#define FUSE_PERIOD_gp  0  /* Watchdog Timeout Period group position. */
#define FUSE_PERIOD0_bm  (1<<0)  /* Watchdog Timeout Period bit 0 mask. */
#define FUSE_PERIOD0_bp  0  /* Watchdog Timeout Period bit 0 position. */
#define FUSE_PERIOD1_bm  (1<<1)  /* Watchdog Timeout Period bit 1 mask. */
#define FUSE_PERIOD1_bp  1  /* Watchdog Timeout Period bit 1 position. */
#define FUSE_PERIOD2_bm  (1<<2)  /* Watchdog Timeout Period bit 2 mask. */
#define FUSE_PERIOD2_bp  2  /* Watchdog Timeout Period bit 2 position. */
#define FUSE_PERIOD3_bm  (1<<3)  /* Watchdog Timeout Period bit 3 mask. */
#define FUSE_PERIOD3_bp  3  /* Watchdog Timeout Period bit 3 position. */
#define FUSE_WINDOW_gm  0xF0  /* Watchdog Window Timeout Period group mask. */
#define FUSE_WINDOW_gp  4  /* Watchdog Window Timeout Period group position. */
#define FUSE_WINDOW0_bm  (1<<4)  /* Watchdog Window Timeout Period bit 0 mask. */
#define FUSE_WINDOW0_bp  4  /* Watchdog Window Timeout Period bit 0 position. */
#define FUSE_WINDOW1_bm  (1<<5)  /* Watchdog Window Timeout Period bit 1 mask. */
#define FUSE_WINDOW1_bp  5  /* Watchdog Window Timeout Period bit 1 position. */
#define FUSE_WINDOW2_bm  (1<<6)  /* Watchdog Window Timeout Period bit 2 mask. */
#define FUSE_WINDOW2_bp  6  /* Watchdog Window Timeout Period bit 2 position. */
#define FUSE_WINDOW3_bm  (1<<7)  /* Watchdog Window Timeout Period bit 3 mask. */
#define FUSE_WINDOW3_bp  7  /* Watchdog Window Timeout Period bit 3 position. */

/* FUSE.BODCFG  bit masks and bit positions */
#define FUSE_SLEEP_gm  0x03  /* BOD Operation in Sleep Mode group mask. */
#define FUSE_SLEEP_gp  0  /* BOD Operation in Sleep Mode group position. */
#define FUSE_SLEEP0_bm  (1<<0)  /* BOD Operation in Sleep Mode bit 0 mask. */
#define FUSE_SLEEP0_bp  0  /* BOD Operation in Sleep Mode bit 0 position. */
#define FUSE_SLEEP1_bm  (1<<1)  /* BOD Operation in Sleep Mode bit 1 mask. */
#define FUSE_SLEEP1_bp  1  /* BOD Operation in Sleep Mode bit 1 position. */
#define FUSE_ACTIVE_gm  0x0C  /* BOD Operation in Active Mode group mask. */
#define FUSE_ACTIVE_gp  2  /* BOD Operation in Active Mode group position. */
#define FUSE_ACTIVE0_bm  (1<<2)  /* BOD Operation in Active Mode bit 0 mask. */
#define FUSE_ACTIVE0_bp  2  /* BOD Operation in Active Mode bit 0 position. */
#define FUSE_ACTIVE1_bm  (1<<3)  /* BOD Operation in Active Mode bit 1 mask. */
#define FUSE_ACTIVE1_bp  3  /* BOD Operation in Active Mode bit 1 position. */
#define FUSE_SAMPFREQ_bm  0x10  /* BOD Sample Frequency bit mask. */
#define FUSE_SAMPFREQ_bp  4  /* BOD Sample Frequency bit position. */
#define FUSE_LVL_gm  0xE0  /* BOD Level group mask. */
#define FUSE_LVL_gp  5  /* BOD Level group position. */
#define FUSE_LVL0_bm  (1<<5)  /* BOD Level bit 0 mask. */
#define FUSE_LVL0_bp  5  /* BOD Level bit 0 position. */
#define FUSE_LVL1_bm  (1<<6)  /* BOD Level bit 1 mask. */
#define FUSE_LVL1_bp  6  /* BOD Level bit 1 position. */
#define FUSE_LVL2_bm  (1<<7)  /* BOD Level bit 2 mask. */
#define FUSE_LVL2_bp  7  /* BOD Level bit 2 position. */

/* FUSE.OSCCFG  bit masks and bit positions */
#define FUSE_FREQSEL_gm  0x03  /* Frequency Select group mask. */
#define FUSE_FREQSEL_gp  0  /* Frequency Select group position. */
#define FUSE_FREQSEL0_bm  (1<<0)  /* Frequency Select bit 0 mask. */
#define FUSE_FREQSEL0_bp  0  /* Frequency Select bit 0 position. */
#define FUSE_FREQSEL1_bm  (1<<1)  /* Frequency Select bit 1 mask. */
#define FUSE_FREQSEL1_bp  1  /* Frequency Select bit 1 position. */
#define FUSE_OSCLOCK_bm  0x80  /* Oscillator Lock bit mask. */
#define FUSE_OSCLOCK_bp  7  /* Oscillator Lock bit position. */

